{
  "uber_q2 2025_lucid": {
    "summary": {
      "summary": "In the Q2 2025 earnings call, Uber highlighted its expanding partnerships in the autonomous vehicle sector, specifically mentioning collaborations with Lucid and Nuro. This is significant as it indicates Uber's commitment to enhancing its autonomous driving capabilities and leveraging partnerships with leading technology and electric vehicle manufacturers, which could drive future growth and innovation.",
      "tradingInsight": "Given the excitement expressed by the CEO regarding the partnership with Lucid, it is highly likely that he will mention 'Lucid' in the next quarter's earnings call, making it a strong prediction for PolyMarket traders to consider."
    },
    "timestamp": 1762309667900
  },
  "celh_q2 2025_pepsico": {
    "summary": {
      "summary": "Celsius reported significant growth in its Alani Nu brand's market share on Amazon, indicating strong consumer demand. Additionally, the company's foodservice volume saw a year-over-year increase, with PepsiCo accounting for about 12% of Celsius's North American brand sales, highlighting the importance of this partnership for future growth.",
      "tradingInsight": "Given the emphasis on PepsiCo's contribution to sales and the expansion of distribution channels, it is highly likely that the CEO will mention 'PepsiCo' in the next quarter's earnings call, making it a strong prediction for PolyMarket traders."
    },
    "timestamp": 1762310179666
  },
  "hood_q2 2025_tokenization": {
    "summary": {
      "summary": "The company emphasized the significance of tokenization, particularly in the context of its recent crypto event in France, highlighting its potential to revolutionize capital markets similar to how stablecoins transformed fiat currencies. They are actively expanding their offerings in Europe and exploring the tokenization of private assets, indicating a strong commitment to this innovation despite regulatory challenges in the U.S.",
      "tradingInsight": "Given the CEO's strong emphasis on tokenization and its strategic importance, it is highly likely he will mention 'Tokenization' in the next quarter's earnings call, making a bet on its mention a favorable prediction for PolyMarket."
    },
    "timestamp": 1762310316564
  }
}